In [3]:
import numpy as np
import pandas as pd
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

In [10]:
import sqlite3
query = """
CREATE TABLE test2
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""
con = sqlite3.connect('mydata.sqlite')
con.execute(query)
con.commit()

In [11]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [12]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5),
 ('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [13]:
cursor.description
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5
3      Atlanta     Georgia  1.25  6
4  Tallahassee     Florida  2.60  3
5   Sacramento  California  1.70  5

In [14]:
import sqlalchemy as sqla
db = sqla.create_engine('sqlite:///mydata.sqlite')
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5
3      Atlanta     Georgia  1.25  6
4  Tallahassee     Florida  2.60  3
5   Sacramento  California  1.70  5

In [9]:
!rm mydata.sqlite

'rm' is not recognized as an internal or external command,
operable program or batch file.

In [26]:
import sqlite3
query = """
CREATE TABLE gamepricing
(sno INTEGER, gameid INTEGER, price VARCHAR(20),date VARCHAR(20));"""
con = sqlite3.connect('mydata.sqlite')
con.execute(query)
con.commit()

In [27]:
data = [(1,1,'$100','3-3-2019'),
        (2,2,'$100','3-1-2019'),
        (3,3,'$60','2-28-2019'),
        (4,4,'$60','2-25-2019'),
        (5,5,'$75','2-27-2019')]
stmt = "INSERT INTO gamepricing VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [28]:
cursor = con.execute('select * from gamepricing')
rows = cursor.fetchall()
rows

[(1, 1, '$100', '3-3-2019'),
 (2, 2, '$100', '3-1-2019'),
 (3, 3, '$60', '2-28-2019'),
 (4, 4, '$60', '2-25-2019'),
 (5, 5, '$75', '2-27-2019')]

In [29]:
cursor.description
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

   sno  gameid price       date
0    1       1  $100   3-3-2019
1    2       2  $100   3-1-2019
2    3       3   $60  2-28-2019
3    4       4   $60  2-25-2019
4    5       5   $75  2-27-2019

In [30]:
import sqlalchemy as sqla
db = sqla.create_engine('sqlite:///mydata.sqlite')
pd.read_sql('select * from gamepricing', db)

   sno  gameid price       date
0    1       1  $100   3-3-2019
1    2       2  $100   3-1-2019
2    3       3   $60  2-28-2019
3    4       4   $60  2-25-2019
4    5       5   $75  2-27-2019

In [43]:
gamepricing = """{"data":[{"sno": 1, "gameid": 1, "price": "$100", "date": "3-3-2019"},
  {"sno": 2, "gameid": 2, "price": "$100", "date": "3-1-2019"},
  {"sno": 3, "gameid": 3, "price": "$60", "date": "2-28-2019"},
  {"sno": 4, "gameid": 4, "price": "$60", "date": "2-25-2019"},
  {"sno": 5, "gameid": 5, "price": "$75", "date": "2-27-2019"}]}"""

In [44]:
import json
result = json.loads(gamepricing)
result

{'data': [{'sno': 1, 'gameid': 1, 'price': '$100', 'date': '3-3-2019'},
  {'sno': 2, 'gameid': 2, 'price': '$100', 'date': '3-1-2019'},
  {'sno': 3, 'gameid': 3, 'price': '$60', 'date': '2-28-2019'},
  {'sno': 4, 'gameid': 4, 'price': '$60', 'date': '2-25-2019'},
  {'sno': 5, 'gameid': 5, 'price': '$75', 'date': '2-27-2019'}]}

In [45]:
asjson = json.dumps(result)

In [46]:
prices = pd.DataFrame(result['data'])
prices

        date  gameid price  sno
0   3-3-2019       1  $100    1
1   3-1-2019       2  $100    2
2  2-28-2019       3   $60    3
3  2-25-2019       4   $60    4
4  2-27-2019       5   $75    5